Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1160/periph/PERI_IEE_APC.h
/*! @name REGION7_RDC_D0 - Region control of core domain 0 for region (n) */
/*! @{ */

#define IEE_APC_REGION7_RDC_D0_RDC_D0_WRITE_DIS_MASK (0x1U)
#define IEE_APC_REGION7_RDC_D0_RDC_D0_WRITE_DIS_SHIFT (0U)
/*! RDC_D0_WRITE_DIS - Write disable of core domain 1
 *  0b0..Write to TOP_ADDR and BOT_ADDR of this region enabled
 *  0b1..Write to TOP_ADDR and BOT_ADDR of this region disabled
 */
#define IEE_APC_REGION7_RDC_D0_RDC_D0_WRITE_DIS(x) (((uint32_t)(((uint32_t)(x)) << IEE_APC_REGION7_RDC_D0_RDC_D0_WRITE_DIS_SHIFT)) & IEE_APC_REGION7_RDC_D0_RDC_D0_WRITE_DIS_MASK)

#define IEE_APC_REGION7_RDC_D0_RDC_D0_LOCK_MASK  (0x2U)
#define IEE_APC_REGION7_RDC_D0_RDC_D0_LOCK_SHIFT (1U)
/*! RDC_D0_LOCK - Lock bit for bit 0
 *  0b0..Bit 0 is unlocked
 *  0b1..Bit 0 is locked
 */
#define IEE_APC_REGION7_RDC_D0_RDC_D0_LOCK(x)    (((uint32_t)(((uint32_t)(x)) << IEE_APC_REGION7_RDC_D0_RDC_D0_LOCK_SHIFT)) & IEE_APC_REGION7_RDC_D0_RDC_D0_LOCK_MASK)
/*! @} */

/*! @name REGION7_RDC_D1 - Region control of core domain 1 for region (n) */
/*! @{ */

#define IEE_APC_REGION7_RDC_D1_RDC_D1_WRITE_DIS_MASK (0x1U)
#define IEE_APC_REGION7_RDC_D1_RDC_D1_WRITE_DIS_SHIFT (0U)
/*! RDC_D1_WRITE_DIS - Write disable of core domain 1
 *  0b0..Write to TOP_ADDR and BOT_ADDR of this region enabled
 *  0b1..Write to TOP_ADDR and BOT_ADDR of this region disabled
 */
#define IEE_APC_REGION7_RDC_D1_RDC_D1_WRITE_DIS(x) (((uint32_t)(((uint32_t)(x)) << IEE_APC_REGION7_RDC_D1_RDC_D1_WRITE_DIS_SHIFT)) & IEE_APC_REGION7_RDC_D1_RDC_D1_WRITE_DIS_MASK)

#define IEE_APC_REGION7_RDC_D1_RDC_D1_LOCK_MASK  (0x2U)
#define IEE_APC_REGION7_RDC_D1_RDC_D1_LOCK_SHIFT (1U)
/*! RDC_D1_LOCK - Lock bit for bit 0
 *  0b0..Bit 0 is unlocked
 *  0b1..Bit 0 is locked
 */
#define IEE_APC_REGION7_RDC_D1_RDC_D1_LOCK(x)    (((uint32_t)(((uint32_t)(x)) << IEE_APC_REGION7_RDC_D1_RDC_D1_LOCK_SHIFT)) & IEE_APC_REGION7_RDC_D1_RDC_D1_LOCK_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group IEE_APC_Register_Masks */


/*!
 * @}
 */ /* end of group IEE_APC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_IEE_APC_H_ */

